namespace larionov_lab_5_arrays
{
    internal class TasksInfo
    {
        public const string TASK_6_1 = "В одномерном массиве, состоящем из п вещественных элементов, вычислить:\n" +
        "I - минимальный элемент массива;\n" +
        "II - сумму элементов массива, расположенных между первым и последним положительными элементами.\n\n" +

        "Преобразовать массив таким образом, чтобы: \n" +
        "сначала располагались все элементы, равные нулю, а потом — все остальные.\n\n\n";

        public const string TASK_16_2 = "В одномерном массиве, состоящем из п вещественных элементов, вычислить:\n" +
        "I - количество отрицательных элементов массива; \n" +
        "II - сумму модулей элементов массива, расположенных после минимального по модулю элемента.\n\n" +

        "Заменить все отрицательные элементы массива их квадратами и\n" +
        "упорядочить элементы массива по возрастанию.\n\n\n";

        public const string TASK_6_3 = "Дана целочисленная прямоугольная матрица.\n" +
        "Определить:\n" +
        "I - сумму элементов в тех строках, которые содержат хотя бы один отрицательный элемент;\n" +
        "II - номера строк и столбцов всех седловых точек матрицы.\n\n\n";

        public const string TASK_16_4 = "Упорядочить строки целочисленной прямоугольной матрицы по возрастанию\n" +
        "количества одинаковых элементов в каждой строке.\n\n" +

        "Найти номер первого из столбцов, не содержащих ни одного отрицательного элемента.\n\n\n";
    }
}
